---
kind: property
id: P:Autodesk.Revit.DB.RevolvedSurface.Axis
zh: 轴、x轴、y轴、z轴
source: html/e8aafaed-78d3-3845-8275-ea8ce0031275.htm
---
# Autodesk.Revit.DB.RevolvedSurface.Axis Property

**中文**: 轴、x轴、y轴、z轴

Axis of the revolved surface. This is the Z axis of the local coordinate system associated with this revolved surface.

## Syntax (C#)
```csharp
public XYZ Axis { get; }
```